src/InformationRegisters/НСИАрхив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НСИАрхив</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НСИАрхив/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Функция НайтиХранилищеЗначенийПоДатам(ДатаНачала, ДатаОкончания) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НСИАрхив.Значение
	               |ИЗ
	               |	РегистрСведений.НСИАрхив КАК НСИАрхив
	               |ГДЕ
	               |	НСИАрхив.ДатаНачала = &ДатаНачала
	               |	И НСИАрхив.ДатаОкончания = &ДатаОкончания";
				   
	Запрос.УстановитьПараметр("ДатаНачала",    ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция АрхивацияРазрешена()
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьЗаписиВАрхив(Команда)
	
	Если Не АрхивацияРазрешена() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ИмяЭлемента", "Выберите период");
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.РедактироватьКакИнтервал = Истина;
		НастройкаПериода.РедактироватьКакПериод = Истина;
		НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
		
		Если НастройкаПериода.Редактировать() Тогда
			СтруктураПериода = Новый Структура("НачалоПериода,КонецПериода",НастройкаПериода.ПолучитьДатуНачала(),НастройкаПериода.ПолучитьДатуОкончания());
			ДобавитьЗаписиВАрхивЗавершение(СтруктураПериода,Неопределено);
		Иначе
			Возврат;	
		КонецЕсли;
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение ИЛИ ТонкийКлиент  Тогда
		ОткрытьФорму("ОбщаяФорма.ВыборПроизвольногоПериода",ПараметрыФормы,,,,, Новый ОписаниеОповещения("ДобавитьЗаписиВАрхивЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Восстановить(Команда)
	
	Если Не АрхивацияРазрешена() Тогда
		Возврат;
	КонецЕсли;

	ТекСтрока = Элементы.Список.ТекущиеДанные;
	ВосстановитьСервер(ТекСтрока.ДатаНачала, ТекСтрока.ДатаОкончания);

КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьЗаПериод(Команда)
	
	Если Не АрхивацияРазрешена() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ИмяЭлемента", "Выберите период");
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.РедактироватьКакИнтервал = Истина;
		НастройкаПериода.РедактироватьКакПериод = Истина;
		НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
		
		Если НастройкаПериода.Редактировать() Тогда
			СтруктураПериода = Новый Структура("НачалоПериода,КонецПериода",НастройкаПериода.ПолучитьДатуНачала(),НастройкаПериода.ПолучитьДатуОкончания());
			ВосстановитьЗаПериодЗавершение(СтруктураПериода,Неопределено);
		Иначе
			Возврат;	
		КонецЕсли;
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение ИЛИ ТонкийКлиент  Тогда
		ОткрытьФорму("ОбщаяФорма.ВыборПроизвольногоПериода",ПараметрыФормы,,,,, Новый ОписаниеОповещения("ВосстановитьЗаПериодЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	#КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ВосстановитьСервер(ДатаНачала, ДатаОкончания)
	Хранилище = НайтиХранилищеЗначенийПоДатам(ДатаНачала, ДатаОкончания);
	
	Если Не Хранилище = Неопределено Тогда
		НСИКлиентСервер.ВосстановитьИсториюИзмененияОбъектов(Хранилище);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьЗаПериодЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
	Если Результат <> Неопределено Тогда
		НачПериода = Результат.НачалоПериода;
		КонПериода = КонецДня(Результат.КонецПериода);
		НСИКлиентСервер.ВосстановитьИсториюЗаПериод(НачПериода, КонПериода);
	КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаписиВАрхивЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> неопределено Тогда
		НачПериода = Результат.НачалоПериода;
		КонПериода = КонецДня(Результат.КонецПериода);
		НСИКлиентСервер.СжатьИсториюИзмененияОбъектов(НачПериода, КонПериода);
	КонецЕсли; 
КонецПроцедуры
